Revit 2024 API
TilePattern.TilePatternType Property
The built-in system tile pattern specified by this object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public TilePatternsBuiltIn TilePatternType { get; }
Visual Basic
Public ReadOnly Property TilePatternType As TilePatternsBuiltIn
	Get
Visual C++
public:
property TilePatternsBuiltIn TilePatternType {
	TilePatternsBuiltIn get ();
}
See Also
TilePattern Class
Autodesk.Revit.DB Namespace